app/controllers/items_controller.rb

  def index
    @items = Item.order(:id)
    @date = DateTime.current
    @out = @items.to_a.reduce(0) do |total , item|
---
SELECT "items".* FROM "items" ORDER BY "items"."id" ASC
SELECT "items".* FROM "items"

  def create
    @item = Item.new(item_params)
    respond_to do |format|
      if @item.save
---
INSERT INTO "items" ("description", "created_at", "updated_at", "serial") VALUES ($1, $2, $3, $4) RETURNING "id"  [["description", "Laptop 1 "], ["created_at", 2017-09-04 10:27:46 UTC], ["updated_at", 2017-09-04 10:27:46 UTC], ["serial", "253jhjfn"]]

  def update
    respond_to do |format|
      if @item.update(item_params)
---
UPDATE "items" SET "item_model" = $1, "item_serial_number" = $2, "updated_at" = $3 WHERE "items"."id" = $4  [["item_model", "Macbook 2015"], ["item_serial_number", "1234"], ["updated_at", 2017-05-12 15:09:11 UTC], ["id", 4]]