app/controllers/logs_controller.rb

SELECT "logs".* FROM "logs"
---
  def index
    @logs = Log.all

SELECT "items".* FROM "items"
SELECT "users".* FROM "users"
---
  def new

    User.token = session[:token]
    @items = Item.all
    @borrowers = User.all

UPDATE "logs" SET "returned_to_id" = $1, "return_date" = $2, "updated_at" = $3 WHERE "logs"."id" = $4  [["returned_to_id", "591890e090f5b7000113a67e"], ["return_date", Tue, 06 Jun 2017], ["updated_at", 2017-06-06 14:27:12 UTC], ["id", 2]]
---
  def checkin
    @log.returned_to_id = current_user.id
    @log.return_date = DateTime.now
    if @log.save

INSERT INTO "logs" ("lender_id", "borrower_id", "created_at", "updated_at", "item_id") VALUES ($1, $2, $3, $4, $5) RETURNING "id"  [["lender_id", "59137e709c5c74000197481a"], ["borrower_id", "59137e709c5c74000197481a"], ["created_at", 2017-05-12 16:51:55 UTC], ["updated_at", 2017-05-12 16:51:55 UTC], ["item_id", 6]]
---
  def create
    @log = Log.new(log_params)



    # Current user checks out
    if current_user
      @log.lender_id = current_user.id
    end

    respond_to do |format|
      if @log.save

UPDATE "logs" SET "returner_id" = $1, "date_returned" = $2, "notes" = $3, "updated_at" = $4 WHERE "logs"."id" = $5  [["returner_id", 1], ["date_returned", Thu, 27 Apr 2017], ["notes", "pristine condition. remove steam files (gaming)"], ["updated_at", 2017-04-27 13:43:21 UTC], ["id", 1]]
---
  def update
    respond_to do |format|
      if @log.update(log_params)

DELETE FROM "logs" WHERE "logs"."id" = $1  [["id", 2]]
---
  def destroy
    @log.destroy

SELECT  "logs".* FROM "logs" WHERE "logs"."id" = $1 LIMIT $2  [["id", 2], ["LIMIT", 1]]
---
    def set_log
      @log = Log.find(params[:id])